Repository: Mosleh92/MallQuest
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

# user_id_password_required
source: User ID and password are required
ar: مطلوب معرف المستخدم وكلمة المرور

source: User not found
ar: المستخدم غير موجود

source: Invalid credentials
ar: بيانات اعتماد غير صالحة

source: OTP required
ar: مطلوب رمز OTP

# invalid_otp
source: Invalid OTP code
ar: رمز OTP غير صالح

source: MFA setup session expired
ar: انتهت جلسة إعداد MFA

source: Failed to save MFA settings
ar: فشل في حفظ إعدادات MFA

# mfa_enabled_success
source: MFA enabled successfully
ar: تم تمكين MFA بنجاح

# user_id_required
source: User ID is required
ar: مطلوب معرف المستخدم

# mfa_not_enabled
source: MFA not enabled for this user
ar: لم يتم تمكين MFA لهذا المستخدم

# otp_or_backup_required
source: OTP or backup code is required
ar: مطلوب رمز OTP أو رمز احتياطي

# mfa_verification_success
source: MFA verification successful
ar: تم التحقق من MFA بنجاح

source: Authentication required
ar: المصادقة مطلوبة

source: Failed to disable MFA
ar: فشل في تعطيل MFA

# mfa_disabled_success
source: MFA disabled successfully
ar: تم تعطيل MFA بنجاح
